experiments/D_additional_matched_mutations/logs/rustsbi/D1_pmpcfg_mod4.source.diff
--- /home/user/sesbi-JSA/experiments/D_additional_matched_mutations/logs/rustsbi/pmpm_lib.rs.clean	2026-07-11 22:09:27.348547073 +0800
+++ /home/user/sesbi-JSA/rustsbi/library/pmpm/src/lib.rs	2026-07-11 22:09:29.307554239 +0800
@@ -130,7 +130,7 @@
 }
 
 pub fn set_pmp_cfg(idx: u32, config: &PmpConfig) {
-    let cfg_idx = (idx % 8) as usize;
+    let cfg_idx = (idx % 4) as usize; /*MUT-D1-PMPCFG-MOD4*/
     unsafe {
         match idx {
             0..=7 => pmpcfg0::set_pmp(cfg_idx, config.range, config.perm, config.is_locked),
