experiments/D_additional_matched_mutations/logs/sesbi/d2_napot_base_low32.source.diff
--- /home/user/sesbi-JSA/experiments/D_additional_matched_mutations/logs/sesbi/sbi_main.c.pristine	2026-07-11 22:09:06.037469085 +0800
+++ /home/user/sesbi-JSA/SeSBI-code/sbi/sbi_main.c	2026-07-11 22:09:50.159630481 +0800
@@ -34,7 +34,7 @@
 
 	printk("%s: start: 0x%lx order %d prot 0x%lx\n", __func__, start, order, prot);
 
-	pmpaddr = start >> PMP_SHIFT;
+	pmpaddr = ((order > PMP_SHIFT) ? (unsigned long)(unsigned int)start : start) >> PMP_SHIFT; /*MUT-D2-NAPOT-BASE-LOW32*/
 
 	/* 对于RV64，对应的cfg寄存器是pmpcfg0，pmpcfg2，pmpcfg4... */
 	pmpcfg_csr   = (CSR_PMPCFG0 + (reg_idx >> 2)) & ~1;
