experiments/D_additional_matched_mutations/logs/sesbi/d3_pmpcfg_bank_fold.source.diff
--- /home/user/sesbi-JSA/experiments/D_additional_matched_mutations/logs/sesbi/sbi_main.c.pristine	2026-07-11 22:09:06.037469085 +0800
+++ /home/user/sesbi-JSA/SeSBI-code/sbi/sbi_main.c	2026-07-11 22:10:12.128710746 +0800
@@ -37,7 +37,7 @@
 	pmpaddr = start >> PMP_SHIFT;
 
 	/* 对于RV64，对应的cfg寄存器是pmpcfg0，pmpcfg2，pmpcfg4... */
-	pmpcfg_csr   = (CSR_PMPCFG0 + (reg_idx >> 2)) & ~1;
+	pmpcfg_csr   = (CSR_PMPCFG0 + (reg_idx >> 3)) & ~1; /*MUT-D3-PMPCFG-BANK-FOLD*/
 	pmpcfg_shift = (reg_idx & 7) << 3;
 
 	pmpaddr_csr = CSR_PMPADDR0 + reg_idx;
